var arr1 = [1,2,3,]
var arr2 = ["a","b","c",]
console.log(typeof arr1[0],arr1[0],typeof arr2[0],arr2[0]);




/*
2.Вывести в консоль из каждого массива по одному элементу с нулевым индексом и определить их типы данных.
3.Объединить этих два массива так , 
чтобы с нулевого по второй индекс были элементы с числовыми значениями,
 а с третьего по пятый со строчными.
4.Вывести в консоль новый массив.
5.Вывести в консоль нулевой и третий индекс нового массива и определить их типы данных.
6.Вывести в консоль тип данных нового массива.
7.Вывести в консоль длину нового массива.
8.Из массива [1, 2, 3, "one", "two", "three"] сделать массив ["three", "two", "one", 3, 2, 1].
9.Из получившегося массива удалить все числовые элементы и вывести в консоль исходный массив.
9.1.В получившемся массиве превратить все строковые элементы в одно слово(один элемент).
10.Создать новый массив с тремя рандомными числовыми значениями.
11.Добавить в начало массива число 100.
12.Добавить в конец массива число 1.
13.Вывести получившейся массив.
14.1 Отсортировать его методом sort() и вывести.
15.2 Отсортировать его методом sort() от наименьшего к наибольшему и вывести. */